package com.capstone.androidproject

import android.os.Bundle
import android.os.SystemClock
import android.util.Log
import android.widget.Toast
import androidx.appcompat.app.AppCompatActivity
import com.capstone.androidproject.Response.EnterpriseDataResponse
import com.capstone.androidproject.Response.MemberDataResponse
import com.capstone.androidproject.Response.UserInfoResponse
import com.capstone.androidproject.ServerConfig.ServerConnect
import com.capstone.androidproject.SharedPreferenceConfig.App
import com.github.jorgecastillo.FillableLoader
import com.github.jorgecastillo.State
import com.github.jorgecastillo.listener.OnStateChangeListener
import org.jetbrains.anko.startActivity
import retrofit2.Call
import retrofit2.Callback
import retrofit2.Response

class SplashActivity : AppCompatActivity() {

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_splash)

        splashAnimation()

    }
    fun login(token: String) {
        val serverConnect = ServerConnect(this)
        val server = serverConnect.conn()

        server.getCustomerInfoRequest(token).enqueue(object : Callback<UserInfoResponse> {
            override fun onFailure(call: Call<UserInfoResponse>?, t: Throwable?) {
                Toast.makeText(this@SplashActivity, "로그인 실패1", Toast.LENGTH_SHORT).show()
                startActivity<LoginActivity>()
                finish()
            }

            override fun onResponse(call: Call<UserInfoResponse>?, response: Response<UserInfoResponse>?) {
                val success = response?.body()?.success
                val userinfo = response?.body()?.data

                if (success == false) {
                    Toast.makeText(this@SplashActivity, "로그인 실패2", Toast.LENGTH_SHORT).show()
                    startActivity<LoginActivity>()
                    finish()
                } else {
                    App.prefs.name = userinfo?.name.toString()
                    App.prefs.id = userinfo?.customerId.toString()

                    startActivity<MainActivity>()
                    finish()
                }
            }
        })
    }



    fun getMember(token: String) {
        val serverConnect = ServerConnect(this)
        val server = serverConnect.conn()

        server.getMemberDataRequest(token).enqueue(object:

            Callback<MemberDataResponse> {
            override fun onFailure(call: Call<MemberDataResponse>, t: Throwable) {
                Toast.makeText(this@SplashActivity, "member 받아오기 실패1", Toast.LENGTH_SHORT).show()
                Log.d("testing","err msg : " + t?.message.toString())
            }
            override fun onResponse(
                call: Call<MemberDataResponse>,
                response: Response<MemberDataResponse>
            ) {
                val success = response?.body()?.success
                val memberdata = response?.body()?.memberdata
                if (success == false) {
                    Toast.makeText(this@SplashActivity, "member 받아오기 실패2", Toast.LENGTH_SHORT).show()
                } else {
                    Toast.makeText(this@SplashActivity, "받아오기 성공", Toast.LENGTH_SHORT).show()
                    if(memberdata?.approval == 1){
                        App.prefs.enterpriseId = memberdata?.enterpriseId
                        App.prefs.enterpriseApproval = memberdata?.approval
                        App.prefs.usedAmountPerDay = memberdata?.amountPerDay
                        App.prefs.usedAmountPerMonth = memberdata?.amountPerMonth
                        App.prefs.resetDate = memberdata?.resetDate

                        Log.d("testing", "resetDate : " + memberdata?.resetDate)

                    }
                }
            }
        })
    }
    fun getEnterprise(enterpriseId : String) {
        val serverConnect = ServerConnect(this)
        val server = serverConnect.conn()

        server.getEnterpriseDataRequest(enterpriseId).enqueue(object:

            Callback<EnterpriseDataResponse> {
            override fun onFailure(call: Call<EnterpriseDataResponse>, t: Throwable) {
                Toast.makeText(this@SplashActivity, "enterprise 받아오기 실패1", Toast.LENGTH_SHORT).show()
                Log.d("testing","err msg : " + t?.message.toString())
            }
            override fun onResponse(
                call: Call<EnterpriseDataResponse>,
                response: Response<EnterpriseDataResponse>
            ) {
                val success = response?.body()?.success
                val enterdata = response?.body()?.enterprisedata
                if (success == false) {
                    Toast.makeText(this@SplashActivity, "enterprise 받아오기 실패2", Toast.LENGTH_SHORT).show()
                } else {
                    Toast.makeText(this@SplashActivity, "받아오기 성공", Toast.LENGTH_SHORT).show()
                    if(App.prefs.enterpriseApproval == 1){
                        App.prefs.amountPerDay = enterdata!!.amountPerDay
                        App.prefs.amountPerMonth = enterdata?.amountPerMonth

                        Log.d("testing", "amountPerDay : " + App.prefs.amountPerDay.toString())
                        Log.d("testing", "usedamountPerDay : " + App.prefs.usedAmountPerDay.toString())

                    }
                }
            }
        })
    }

    private fun splashAnimation() {
        val STRING_SVG_PATH = "M 553.00,421.61\n" +
                "           C 552.26,421.48 551.06,420.81 550.21,419.45\n" +
                "             550.10,419.28 550.01,419.10 549.91,418.91\n" +
                "             549.91,418.96 549.98,385.12 549.75,385.06\n" +
                "             549.91,384.82 539.96,384.94 540.00,384.94\n" +
                "             540.00,384.96 539.09,421.41 542.57,425.96\n" +
                "             546.45,431.03 550.09,430.35 551.98,433.30\n" +
                "             553.21,435.22 553.00,438.75 553.00,441.00\n" +
                "             553.00,441.00 553.00,478.00 553.00,478.00\n" +
                "             553.00,479.99 552.77,483.81 554.02,485.40\n" +
                "             555.91,487.79 562.02,487.37 563.43,484.57\n" +
                "             564.14,483.15 564.00,479.66 564.00,478.00\n" +
                "             564.00,478.00 564.00,441.00 564.00,441.00\n" +
                "             564.00,438.75 563.79,435.22 565.02,433.30\n" +
                "             567.07,430.10 573.33,430.24 576.11,423.00\n" +
                "             577.32,419.84 577.00,413.56 577.00,410.00\n" +
                "             577.00,410.00 577.00,385.00 577.00,385.00\n" +
                "             577.00,385.00 566.84,385.00 566.84,385.00\n" +
                "             566.84,385.00 566.91,419.57 566.91,419.52\n" +
                "             566.91,419.61 565.70,421.52 563.12,421.94\n" +
                "             563.09,421.91 562.87,384.91 562.75,385.00\n" +
                "             562.83,384.96 553.04,384.96 553.00,385.00\n" +
                "             553.00,384.96 553.09,421.70 553.00,421.61 Z\n" +
                "           M 594.00,385.00\n" +
                "           C 594.00,385.00 594.00,426.00 594.00,426.00\n" +
                "             594.00,426.00 594.00,452.00 594.00,452.00\n" +
                "             594.00,452.00 594.00,480.00 594.00,480.00\n" +
                "             594.03,481.59 593.93,483.95 594.99,485.26\n" +
                "             596.92,487.65 602.97,487.61 604.40,484.69\n" +
                "             605.44,482.56 604.99,464.70 605.00,461.00\n" +
                "             605.00,458.73 604.78,455.34 606.02,453.39\n" +
                "             608.35,449.74 618.29,447.38 621.26,443.61\n" +
                "             623.32,441.00 622.99,437.15 623.00,434.00\n" +
                "             623.03,417.28 626.80,392.40 606.00,386.30\n" +
                "             601.80,385.07 598.30,385.01 594.00,385.00 Z\n" +
                "           M 603.00,397.18\n" +
                "           C 606.64,396.27 611.15,404.04 611.15,404.04\n" +
                "             611.15,404.04 612.00,431.00 612.00,431.00\n" +
                "             612.00,431.00 611.91,437.00 611.91,436.55\n" +
                "             611.81,436.88 610.18,439.64 605.09,442.36\n" +
                "             604.45,442.81 603.18,442.45 603.09,442.36\n" +
                "             603.18,442.18 602.91,397.00 603.00,397.18 Z\n" +
                "           M 232.00,479.00\n" +
                "           C 232.00,479.00 232.00,494.00 232.00,494.00\n" +
                "             232.00,494.00 494.00,494.00 494.00,494.00\n" +
                "             494.00,494.00 494.00,479.00 494.00,479.00\n" +
                "             494.00,479.00 232.00,479.00 232.00,479.00 Z\n" +
                "           M 668.00,479.00\n" +
                "           C 668.00,479.00 668.00,494.00 668.00,494.00\n" +
                "             668.00,494.00 930.00,494.00 930.00,494.00\n" +
                "             930.00,494.00 930.00,479.00 930.00,479.00\n" +
                "             930.00,479.00 668.00,479.00 668.00,479.00 Z\n" +
                "           M 116.00,522.00\n" +
                "           C 116.00,522.00 116.00,756.00 116.00,756.00\n" +
                "             116.00,756.00 1046.00,756.00 1046.00,756.00\n" +
                "             1046.00,756.00 1046.00,522.00 1046.00,522.00\n" +
                "             1046.00,522.00 116.00,522.00 116.00,522.00 Z\n" +
                "           M 1031.00,538.00\n" +
                "           C 1031.00,538.00 1031.00,740.00 1031.00,740.00\n" +
                "             1031.00,740.00 131.00,740.00 131.00,740.00\n" +
                "             131.00,740.00 131.00,538.00 131.00,538.00\n" +
                "             131.00,538.00 1031.00,538.00 1031.00,538.00 Z\n" +
                "           M 860.00,628.00\n" +
                "           C 860.00,628.00 824.00,628.00 824.00,628.00\n" +
                "             824.00,628.00 824.00,641.00 824.00,641.00\n" +
                "             824.00,641.00 843.00,641.00 843.00,641.00\n" +
                "             843.00,641.00 844.00,664.00 844.00,664.00\n" +
                "             844.00,664.00 831.00,665.83 831.00,665.83\n" +
                "             820.09,666.92 809.48,663.89 802.75,654.83\n" +
                "             798.67,649.35 797.08,642.73 797.00,636.00\n" +
                "             796.92,629.07 796.68,622.59 799.27,616.00\n" +
                "             803.59,604.97 815.33,598.38 827.00,599.09\n" +
                "             831.40,599.36 838.01,601.43 842.00,603.32\n" +
                "             844.16,604.35 848.72,607.47 850.79,607.41\n" +
                "             854.81,607.29 858.40,597.48 856.31,594.32\n" +
                "             850.79,585.97 832.28,583.89 823.00,584.01\n" +
                "             795.04,584.37 778.31,603.61 778.00,631.00\n" +
                "             777.68,659.29 793.44,679.95 823.00,680.00\n" +
                "             832.74,680.02 840.42,680.06 850.00,677.41\n" +
                "             852.16,676.81 857.70,675.04 859.01,673.30\n" +
                "             860.26,671.63 860.00,668.04 860.00,666.00\n" +
                "             860.00,666.00 860.00,628.00 860.00,628.00 Z\n" +
                "           M 219.00,679.00\n" +
                "           C 219.00,679.00 281.00,679.00 281.00,679.00\n" +
                "             281.00,679.00 281.00,664.00 281.00,664.00\n" +
                "             281.00,664.00 238.00,664.00 238.00,664.00\n" +
                "             238.00,664.00 238.00,604.00 238.00,604.00\n" +
                "             238.00,587.36 239.54,585.16 231.00,585.00\n" +
                "             231.00,585.00 227.00,585.00 227.00,585.00\n" +
                "             225.18,585.01 222.07,584.85 220.60,586.02\n" +
                "             218.90,587.37 219.04,590.05 219.00,592.00\n" +
                "             219.00,592.00 219.00,607.00 219.00,607.00\n" +
                "             219.00,607.00 219.00,679.00 219.00,679.00 Z\n" +
                "           M 472.00,679.00\n" +
                "           C 472.00,679.00 536.00,679.00 536.00,679.00\n" +
                "             536.00,679.00 536.00,665.00 536.00,665.00\n" +
                "             536.00,665.00 490.00,665.00 490.00,665.00\n" +
                "             490.00,665.00 490.00,639.00 490.00,639.00\n" +
                "             490.00,639.00 525.00,639.00 525.00,639.00\n" +
                "             525.00,639.00 531.98,637.40 531.98,637.40\n" +
                "             531.98,637.40 533.00,624.00 533.00,624.00\n" +
                "             533.00,624.00 490.00,624.00 490.00,624.00\n" +
                "             490.00,624.00 490.00,600.00 490.00,600.00\n" +
                "             490.00,600.00 536.00,600.00 536.00,600.00\n" +
                "             536.00,586.15 537.09,585.06 528.00,585.00\n" +
                "             528.00,585.00 481.00,585.00 481.00,585.00\n" +
                "             480.44,585.00 472.01,584.99 472.01,584.99\n" +
                "             472.00,585.00 472.01,591.57 472.00,592.00\n" +
                "             472.00,592.00 472.00,608.00 472.00,608.00\n" +
                "             472.00,608.00 472.00,679.00 472.00,679.00 Z\n" +
                "           M 379.00,613.00\n" +
                "           C 379.00,613.00 366.00,613.00 366.00,613.00\n" +
                "             366.00,613.00 366.00,626.00 366.00,626.00\n" +
                "             366.00,626.00 379.00,626.00 379.00,626.00\n" +
                "             379.00,626.00 379.00,647.00 379.00,647.00\n" +
                "             379.00,660.42 377.62,674.50 394.00,679.21\n" +
                "             397.22,680.14 400.68,680.03 404.00,680.00\n" +
                "             408.51,679.95 409.71,679.57 414.00,679.00\n" +
                "             414.00,679.00 414.00,665.00 414.00,665.00\n" +
                "             409.80,665.34 406.05,666.44 402.04,664.43\n" +
                "             396.82,661.81 396.07,657.27 396.00,652.00\n" +
                "             396.00,652.00 396.00,626.00 396.00,626.00\n" +
                "             396.00,626.00 414.00,626.00 414.00,626.00\n" +
                "             414.00,626.00 414.00,613.00 414.00,613.00\n" +
                "             414.00,613.00 396.00,613.00 396.00,613.00\n" +
                "             396.00,613.00 396.00,591.00 396.00,591.00\n" +
                "             392.71,591.51 381.88,594.19 379.99,596.70\n" +
                "             378.41,598.81 379.00,609.85 379.00,613.00 Z\n" +
                "           M 646.00,613.00\n" +
                "           C 646.00,613.00 633.00,613.00 633.00,613.00\n" +
                "             633.00,613.00 633.00,626.00 633.00,626.00\n" +
                "             633.00,626.00 646.00,626.00 646.00,626.00\n" +
                "             646.00,626.00 646.00,647.00 646.00,647.00\n" +
                "             646.00,660.52 645.13,673.93 661.00,679.09\n" +
                "             664.52,680.23 668.34,680.04 672.00,680.00\n" +
                "             676.21,679.95 676.95,679.73 681.00,679.00\n" +
                "             681.00,679.00 681.00,664.84 681.00,664.84\n" +
                "             677.35,665.29 673.48,666.38 670.02,664.84\n" +
                "             664.87,662.16 664.07,658.17 664.00,653.00\n" +
                "             664.00,653.00 664.00,626.00 664.00,626.00\n" +
                "             664.00,626.00 681.00,626.00 681.00,626.00\n" +
                "             681.00,626.00 681.00,613.00 681.00,613.00\n" +
                "             681.00,613.00 664.00,613.00 664.00,613.00\n" +
                "             664.00,613.00 664.00,591.00 664.00,591.00\n" +
                "             660.26,591.34 648.24,593.99 646.57,597.42\n" +
                "             645.65,599.32 646.00,610.19 646.00,613.00 Z\n" +
                "           M 356.00,672.00\n" +
                "           C 356.00,672.00 351.00,660.00 351.00,660.00\n" +
                "             351.00,660.00 340.00,664.89 340.00,664.89\n" +
                "             330.30,668.26 318.79,667.05 313.68,657.00\n" +
                "             312.25,654.18 311.59,650.14 311.00,647.00\n" +
                "             311.00,647.00 357.00,647.00 357.00,647.00\n" +
                "             356.99,637.42 355.56,627.49 348.67,620.18\n" +
                "             339.97,610.95 321.97,609.38 311.00,614.99\n" +
                "             306.57,617.26 302.83,620.86 300.11,625.00\n" +
                "             288.88,642.05 293.15,668.53 313.00,677.33\n" +
                "             322.08,681.05 336.78,681.11 346.00,677.33\n" +
                "             349.71,676.10 352.70,674.15 356.00,672.00 Z\n" +
                "           M 601.00,672.00\n" +
                "           C 601.00,672.00 601.00,679.00 601.00,679.00\n" +
                "             601.00,679.00 619.00,679.00 619.00,679.00\n" +
                "             619.00,679.00 619.00,613.00 619.00,613.00\n" +
                "             602.44,613.00 601.29,611.75 601.00,620.00\n" +
                "             592.86,613.14 589.46,611.88 579.00,612.00\n" +
                "             541.88,612.44 541.01,679.55 579.00,680.00\n" +
                "             589.11,680.11 593.27,678.91 601.00,672.00 Z\n" +
                "           M 904.00,612.46\n" +
                "           C 897.62,613.85 893.08,615.55 888.32,620.32\n" +
                "             871.84,636.87 876.06,679.60 910.00,680.00\n" +
                "             921.90,680.14 930.15,679.41 938.98,670.25\n" +
                "             948.25,660.65 949.52,640.74 944.09,629.00\n" +
                "             941.71,623.88 937.75,619.57 933.00,616.56\n" +
                "             924.54,611.19 913.67,611.13 904.00,612.46 Z\n" +
                "           M 600.00,621.00\n" +
                "           C 600.00,621.00 600.00,622.00 600.00,622.00\n" +
                "             600.00,622.00 599.00,621.00 599.00,621.00\n" +
                "             599.00,621.00 600.00,621.00 600.00,621.00 Z\n" +
                "           M 341.00,638.00\n" +
                "           C 341.00,638.00 312.00,638.00 312.00,638.00\n" +
                "             313.74,628.86 318.80,624.78 328.00,625.02\n" +
                "             331.11,625.10 333.37,625.35 335.87,627.43\n" +
                "             339.16,630.17 340.27,633.98 341.00,638.00 Z\n" +
                "           M 584.00,625.47\n" +
                "           C 588.73,625.66 593.25,626.56 596.61,630.21\n" +
                "             603.30,637.49 605.19,665.56 586.00,666.79\n" +
                "             565.12,668.12 565.11,637.71 574.21,629.39\n" +
                "             577.08,626.77 580.29,625.97 584.00,625.47 Z\n" +
                "           M 913.00,625.46\n" +
                "           C 924.47,626.15 928.87,633.18 929.00,644.00\n" +
                "             929.13,655.18 927.14,666.82 913.00,666.82\n" +
                "             893.19,666.82 894.73,638.74 900.65,631.10\n" +
                "             903.88,626.93 908.04,625.99 913.00,625.46 Z\n" +
                "           M 532.00,637.00\n" +
                "           C 532.00,637.00 532.00,638.00 532.00,638.00\n" +
                "             532.00,638.00 531.00,637.00 531.00,637.00\n" +
                "             531.00,637.00 532.00,637.00 532.00,637.00 Z\n" +
                "           M 698.00,660.00\n" +
                "           C 698.00,660.00 698.00,679.00 698.00,679.00\n" +
                "             698.00,679.00 706.00,679.00 706.00,679.00\n" +
                "             703.34,686.42 695.38,693.53 708.00,697.00\n" +
                "             710.20,693.70 712.82,690.62 714.48,687.00\n" +
                "             718.56,678.10 718.00,669.48 718.00,660.00\n" +
                "             718.00,660.00 698.00,660.00 698.00,660.00 Z\n" +
                "           M 232.00,791.00\n" +
                "           C 232.00,791.00 232.00,807.00 232.00,807.00\n" +
                "             232.00,807.00 930.00,807.00 930.00,807.00\n" +
                "             930.00,807.00 930.00,791.00 930.00,791.00\n" +
                "             930.00,791.00 232.00,791.00 232.00,791.00 Z"
        var fl = findViewById(R.id.fillableLoader) as FillableLoader

        fl.setOnStateChangeListener(object : OnStateChangeListener {
            override fun onStateChange(i: Int) {
                if (i == State.FINISHED) {
                    if (App.prefs.token != "") {
                        getMember(App.prefs.token)
                        Log.d("testing", "enterprseId in SplashActivity : " + App.prefs.enterpriseId)
                        getEnterprise(App.prefs.enterpriseId)
                        login(App.prefs.token)
                        SystemClock.sleep(300)
                    }
                    //로그인 돼있으면 바로 로그인
                    //shared preference에 정보 저장돼있으면 로그인 돼있는걸로 판단함

                    else{
                        startActivity<LoginActivity>()
                        finish()
                    }
                }
            }
        })

        fl.setSvgPath(STRING_SVG_PATH)
        fl.start()
    }

}
